[
  {
    "id": 1,
    "title": "Woven with Purpose: Why We Choose Indian-Made Natural Fabrics",
    "excerpt": "At The Modesse, every piece we craft begins with a simple yet powerful choice—to source locally and sustainably. Our journey is rooted in the incredible legacy of Indian textiles, and we've made a conscious decision to work exclusively with natural, India-made fabrics like khadi, handloom, linen, and cotton.<br />These fabrics aren't just materials; they are stories woven by skilled hands, passed down through generations. They breathe, they adapt, they soften with time—and they align beautifully with our philosophy of slow, conscious fashion. Unlike synthetic counterparts, natural fabrics are biodegradable, skin-friendly, and require fewer chemical processes, making them a responsible choice for you and the planet.<br />By supporting Indian textile artisans, we not only preserve traditional craftsmanship but also reduce our carbon footprint, as our fabrics travel shorter distances from loom to wardrobe. In every stitch, there's care. In every fiber, there's intention.",
    "content": "At The Modesse, every piece we craft begins with a simple yet powerful choice—to source locally and sustainably. Our journey is rooted in the incredible legacy of Indian textiles, and we've made a conscious decision to work exclusively with natural, India-made fabrics like khadi, handloom, linen, and cotton. These fabrics aren't just materials; they are stories woven by skilled hands, passed down through generations. They breathe, they adapt, they soften with time—and they align beautifully with our philosophy of slow, conscious fashion. Unlike synthetic counterparts, natural fabrics are biodegradable, skin-friendly, and require fewer chemical processes, making them a responsible choice for you and the planet. By supporting Indian textile artisans, we not only preserve traditional craftsmanship but also reduce our carbon footprint, as our fabrics travel shorter distances from loom to wardrobe. In every stitch, there's care. In every fiber, there's intention.",
    "date": "2025-05-01",
    "rating": 5,
    "image": "/src/assets/images/banner5.jpg"
  },
  
  {
    "id": 4,
    "title": "The Sustainable Switch: Why We Use Cotton Labels & Fabric Buttons",
    "excerpt": "Sustainability is in the details.<br />At The Modesse, we've said goodbye to polyester satin labels and plastic buttons—not just for aesthetics, but for the planet. Instead, we use cotton-based labels that are biodegradable, soft on skin, and aligned with our natural fabric ethos. We've also chosen fabric-covered buttons, crafted from leftover textiles, turning waste into beautiful, functional accents.<br />These choices might seem small, but collectively, they cut down plastic use, reduce landfill waste, and support a more holistic form of eco-conscious production. To us, sustainability is not a trend—it's a commitment we reflect in every seam, label, and fastener.",
    "content": "Sustainability is in the details. At The Modesse, we've said goodbye to polyester satin labels and plastic buttons—not just for aesthetics, but for the planet. Instead, we use cotton-based labels that are biodegradable, soft on skin, and aligned with our natural fabric ethos. We've also chosen fabric-covered buttons, crafted from leftover textiles, turning waste into beautiful, functional accents. These choices might seem small, but collectively, they cut down plastic use, reduce landfill waste, and support a more holistic form of eco-conscious production. To us, sustainability is not a trend—it's a commitment we reflect in every seam, label, and fastener.",
    "date": "2024-05-07",
    "rating": 4,
    "image": "https://images.squarespace-cdn.com/content/v1/53c40897e4b056f825685959/1435603290241-N760BXDPURBJDQ57FIWU/image-asset.jpeg"
  },
  {
    "id": 5,
    "title": "Contemporary Meets Conscious: Designing for Today with a Sustainable Heart",
    "excerpt": "Can modern style coexist with age-old wisdom? At The Modesse, we think it must.<br />Our designs are contemporary in silhouette, yet deeply rooted in traditional values. We combine clean lines and understated elegance with the softness of natural fibers and the grounding beauty of Indian-made textiles. We believe you shouldn't have to choose between style and sustainability—you deserve both.<br />Every garment is created with intention: fabrics that breathe, forms that flatter, details that matter. We design not for fleeting trends, but for enduring relevance—pieces that can be worn, reworn, and loved for years to come.<br />Because fashion can be future-facing without leaving the earth behind.",
    "content": "Can modern style coexist with age-old wisdom? At The Modesse, we think it must. Our designs are contemporary in silhouette, yet deeply rooted in traditional values. We combine clean lines and understated elegance with the softness of natural fibers and the grounding beauty of Indian-made textiles. We believe you shouldn't have to choose between style and sustainability—you deserve both. Every garment is created with intention: fabrics that breathe, forms that flatter, details that matter. We design not for fleeting trends, but for enduring relevance—pieces that can be worn, reworn, and loved for years to come. Because fashion can be future-facing without leaving the earth behind.",
    "date": "2025-05-10",
    "rating": 5,
    "image": "/src/assets/images/banner5.jpg"
  }
] 